ArduCAM/Energia/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/fpb.xml
<module id="FPB" HW_revision=""><register id="FP_CTRL_" width="32" offset="0x0" internal="0" description="Flash Patch Control Register"><bitfield id="ENABLE" description="Flash patch unit enable bit" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="ENABLE__0" value="0x0" description="flash patch unit disabled"/><bitenum id="ENABLE__1" value="0x1" description="flash patch unit enabled"/></bitfield><bitfield id="KEY" description="Key field" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="NUM_CODE1" description="Number of code slots field." begin="7" end="4" width="4" rwaccess="R/W"><bitenum id="NUM_CODE1__0" value="0x0" description="no code slots"/><bitenum id="NUM_CODE1__2" value="0x2" description="two code slots"/><bitenum id="NUM_CODE1__6" value="0x6" description="six code slots"/></bitfield><bitfield id="NUM_LIT" description="Number of literal slots field." begin="11" end="8" width="4" rwaccess="R/W"><bitenum id="NUM_LIT__0" value="0x0" description="no literal slots"/><bitenum id="NUM_LIT__2" value="0x2" description="two literal slots"/></bitfield><bitfield id="NUM_CODE2" description="Number of full banks of code comparators, sixteen comparators p" begin="13" end="12" width="2" rwaccess="R/W"/></register><register id="FP_REMAP_" width="32" offset="0x4" internal="0" description="Flash Patch Remap Register"><bitfield id="REMAP" description="Remap base address field." begin="28" end="5" width="24" rwaccess="R/W"/></register><register id="FP_COMP0_" width="32" offset="0x8" internal="0" description="Flash Patch Comparator Registers"><bitfield id="ENABLE" description="Compare and remap enable for Flash Patch Comparator Register 0" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="ENABLE__0" value="0x0" description="Flash Patch Comparator Register 0 compare and remap disabled"/><bitenum id="ENABLE__1" value="0x1" description="Flash Patch Comparator Register 0 compare and remap enabled"/></bitfield><bitfield id="COMP" description="Comparison address." begin="28" end="2" width="27" rwaccess="R/W"/><bitfield id="REPLACE" description="This selects what happens when the COMP address is matched" begin="31" end="30" width="2" rwaccess="R/W"><bitenum id="REPLACE__0" value="0x0" description="remap to remap address. See FP_REMAP"/><bitenum id="REPLACE__1" value="0x1" description="set BKPT on lower halfword, upper is unaffected"/><bitenum id="REPLACE__2" value="0x2" description="set BKPT on upper halfword, lower is unaffected"/><bitenum id="REPLACE__3" value="0x3" description="set BKPT on both lower and upper halfwords."/></bitfield></register><register id="FP_COMP1_" width="32" offset="0xC" internal="0" description="Flash Patch Comparator Registers"><bitfield id="ENABLE" description="Compare and remap enable for Flash Patch Comparator Register 1" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="ENABLE__0" value="0x0" description="Flash Patch Comparator Register 1 compare and remap disabled"/><bitenum id="ENABLE__1" value="0x1" description="Flash Patch Comparator Register 1 compare and remap enabled"/></bitfield><bitfield id="COMP" description="Comparison address." begin="28" end="2" width="27" rwaccess="R/W"/><bitfield id="REPLACE" description="This selects what happens when the COMP address is matched" begin="31" end="30" width="2" rwaccess="R/W"><bitenum id="REPLACE__0" value="0x0" description="remap to remap address. See FP_REMAP"/><bitenum id="REPLACE__1" value="0x1" description="set BKPT on lower halfword, upper is unaffected"/><bitenum id="REPLACE__2" value="0x2" description="set BKPT on upper halfword, lower is unaffected"/><bitenum id="REPLACE__3" value="0x3" description="set BKPT on both lower and upper halfwords."/></bitfield></register><register id="FP_COMP2_" width="32" offset="0x10" internal="0" description="Flash Patch Comparator Registers"><bitfield id="ENABLE" description="Compare and remap enable for Flash Patch Comparator Register 2" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="ENABLE__0" value="0x0" description="Flash Patch Comparator Register 2 compare and remap disabled"/><bitenum id="ENABLE__1" value="0x1" description="Flash Patch Comparator Register 2 compare and remap enabled"/></bitfield><bitfield id="COMP" description="Comparison address." begin="28" end="2" width="27" rwaccess="R/W"/><bitfield id="REPLACE" description="This selects what happens when the COMP address is matched" begin="31" end="30" width="2" rwaccess="R/W"><bitenum id="REPLACE__0" value="0x0" description="remap to remap address. See FP_REMAP"/><bitenum id="REPLACE__1" value="0x1" description="set BKPT on lower halfword, upper is unaffected"/><bitenum id="REPLACE__2" value="0x2" description="set BKPT on upper halfword, lower is unaffected"/><bitenum id="REPLACE__3" value="0x3" description="set BKPT on both lower and upper halfwords."/></bitfield></register><register id="FP_COMP3_" width="32" offset="0x14" internal="0" description="Flash Patch Comparator Registers"><bitfield id="ENABLE" description="Compare and remap enable for Flash Patch Comparator Register 3" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="ENABLE__0" value="0x0" description="Flash Patch Comparator Register 3 compare and remap disabled"/><bitenum id="ENABLE__1" value="0x1" description="Flash Patch Comparator Register 3 compare and remap enabled"/></bitfield><bitfield id="COMP" description="Comparison address." begin="28" end="2" width="27" rwaccess="R/W"/><bitfield id="REPLACE" description="This selects what happens when the COMP address is matched" begin="31" end="30" width="2" rwaccess="R/W"><bitenum id="REPLACE__0" value="0x0" description="remap to remap address. See FP_REMAP"/><bitenum id="REPLACE__1" value="0x1" description="set BKPT on lower halfword, upper is unaffected"/><bitenum id="REPLACE__2" value="0x2" description="set BKPT on upper halfword, lower is unaffected"/><bitenum id="REPLACE__3" value="0x3" description="set BKPT on both lower and upper halfwords."/></bitfield></register><register id="FP_COMP4_" width="32" offset="0x18" internal="0" description="Flash Patch Comparator Registers"><bitfield id="ENABLE" description="Compare and remap enable for Flash Patch Comparator Register 4" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="ENABLE__0" value="0x0" description="Flash Patch Comparator Register 4 compare and remap disabled"/><bitenum id="ENABLE__1" value="0x1" description="Flash Patch Comparator Register 4 compare and remap enabled"/></bitfield><bitfield id="COMP" description="Comparison address." begin="28" end="2" width="27" rwaccess="R/W"/><bitfield id="REPLACE" description="This selects what happens when the COMP address is matched" begin="31" end="30" width="2" rwaccess="R/W"><bitenum id="REPLACE__0" value="0x0" description="remap to remap address. See FP_REMAP"/><bitenum id="REPLACE__1" value="0x1" description="set BKPT on lower halfword, upper is unaffected"/><bitenum id="REPLACE__2" value="0x2" description="set BKPT on upper halfword, lower is unaffected"/><bitenum id="REPLACE__3" value="0x3" description="set BKPT on both lower and upper halfwords."/></bitfield></register><register id="FP_COMP5_" width="32" offset="0x1C" internal="0" description="Flash Patch Comparator Registers"><bitfield id="ENABLE" description="Compare and remap enable for Flash Patch Comparator Register 5" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="ENABLE__0" value="0x0" description="Flash Patch Comparator Register 5 compare and remap disabled"/><bitenum id="ENABLE__1" value="0x1" description="Flash Patch Comparator Register 5 compare and remap enabled"/></bitfield><bitfield id="COMP" description="Comparison address." begin="28" end="2" width="27" rwaccess="R/W"/><bitfield id="REPLACE" description="This selects what happens when the COMP address is matched" begin="31" end="30" width="2" rwaccess="R/W"><bitenum id="REPLACE__0" value="0x0" description="remap to remap address. See FP_REMAP"/><bitenum id="REPLACE__1" value="0x1" description="set BKPT on lower halfword, upper is unaffected"/><bitenum id="REPLACE__2" value="0x2" description="set BKPT on upper halfword, lower is unaffected"/><bitenum id="REPLACE__3" value="0x3" description="set BKPT on both lower and upper halfwords."/></bitfield></register><register id="FP_COMP6_" width="32" offset="0x20" internal="0" description="Flash Patch Comparator Registers"><bitfield id="ENABLE" description="Compare and remap enable for Flash Patch Comparator Register 6" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="ENABLE__0" value="0x0" description="Flash Patch Comparator Register 6 compare and remap disabled"/><bitenum id="ENABLE__1" value="0x1" description="Flash Patch Comparator Register 6 compare and remap enabled"/></bitfield><bitfield id="COMP" description="Comparison address." begin="28" end="2" width="27" rwaccess="R/W"/><bitfield id="REPLACE" description="This selects what happens when the COMP address is matched" begin="31" end="30" width="2" rwaccess="R/W"><bitenum id="REPLACE__0" value="0x0" description="remap to remap address. See FP_REMAP"/><bitenum id="REPLACE__1" value="0x1" description="set BKPT on lower halfword, upper is unaffected"/><bitenum id="REPLACE__2" value="0x2" description="set BKPT on upper halfword, lower is unaffected"/><bitenum id="REPLACE__3" value="0x3" description="set BKPT on both lower and upper halfwords."/></bitfield></register><register id="FP_COMP7_" width="32" offset="0x24" internal="0" description="Flash Patch Comparator Registers"><bitfield id="ENABLE" description="Compare and remap enable for Flash Patch Comparator Register 7" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="ENABLE__0" value="0x0" description="Flash Patch Comparator Register 7 compare and remap disabled"/><bitenum id="ENABLE__1" value="0x1" description="Flash Patch Comparator Register 7 compare and remap enabled"/></bitfield><bitfield id="COMP" description="Comparison address." begin="28" end="2" width="27" rwaccess="R/W"/><bitfield id="REPLACE" description="This selects what happens when the COMP address is matched" begin="31" end="30" width="2" rwaccess="R/W"><bitenum id="REPLACE__0" value="0x0" description="remap to remap address. See FP_REMAP"/><bitenum id="REPLACE__1" value="0x1" description="set BKPT on lower halfword, upper is unaffected"/><bitenum id="REPLACE__2" value="0x2" description="set BKPT on upper halfword, lower is unaffected"/><bitenum id="REPLACE__3" value="0x3" description="set BKPT on both lower and upper halfwords."/></bitfield></register></module>